# StructuralSectionGeneralT Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralT Class
Members See Also
---
Defines parameters for Tees shape.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralT : StructuralSectionHotRolled
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralT _
	Inherits StructuralSectionHotRolled
```

Visual C++
---
```text
public ref class StructuralSectionGeneralT : public StructuralSectionHotRolled
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionHotRolled Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralT Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionISplitParallelFlange Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionISplitSlopedFlange Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionStructuralTees
# See Also
StructuralSectionGeneralT Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace